linux和它的小伙伴/体验libvirt虚拟机.org
#+TITLE: 体验libvirt虚拟机
#+AUTHOR: lujun9972
#+TAGS: ../
#+DATE: [2018-07-31 二 10:53]
#+LANGUAGE:  zh-CN
#+OPTIONS:  H:6 num:nil toc:t \n:nil ::t |:t ^:nil -:nil f:t *:t <:nil

