linux和它的小伙伴/体验libvirt虚拟机.org
* 安装虚拟化工具
   #+BEGIN_SRC shell :dir /sudo:: :results org
     sudo pacman -S qemu virt-manager virt-viewer libvirt --noconfirm
   #+END_SRC

   #+RESULTS:
   #+BEGIN_SRC org
   resolving dependencies...
   looking for conflicting packages...

   Packages (4) libvirt-4.5.0-1  qemu-2.12.0-2  virt-manager-1.5.1-1
                virt-viewer-6.0-1

   Total Download Size:    0.22 MiB
   Total Installed Size:  67.46 MiB
   Net Upgrade Size:       1.90 MiB

   :: Proceed with installation? [Y/n] 
   :: Retrieving packages...
    virt-viewer-6.0-1-x...     0.0   B  0.00B/s 00:00 [----------------------]   0% virt-viewer-6.0-1-x...    40.4 KiB  67.4K/s 00:02 [###-------------------]  17% virt-viewer-6.0-1-x...   107.7 KiB   155K/s 00:00 [##########------------]  47% virt-viewer-6.0-1-x...   165.2 KiB   139K/s 00:00 [################------]  73% virt-viewer-6.0-1-x...   225.4 KiB   217K/s 00:01 [######################] 100%
   (0/4) checking keys in keyring                     [----------------------]   0%(1/4) checking keys in keyring                     [#####-----------------]  25%(2/4) checking keys in keyring                     [###########-----------]  50%(3/4) checking keys in keyring                     [################------]  75%(4/4) checking keys in keyring                     [######################] 100%
   (0/4) checking package integrity                   [----------------------]   0%(1/4) checking package integrity                   [##########------------]  46%(2/4) checking package integrity                   [#####################-]  98%(3/4) checking package integrity                   [#####################-]  98%(4/4) checking package integrity                   [######################] 100%
   (0/4) loading package files                        [----------------------]   0%(1/4) loading package files                        [##########------------]  46%(2/4) loading package files                        [#####################-]  98%(3/4) loading package files                        [#####################-]  98%(4/4) loading package files                        [######################] 100%
   (0/4) checking for file conflicts                  [----------------------]   0%(1/4) checking for file conflicts                  [#####-----------------]  25%(2/4) checking for file conflicts                  [###########-----------]  50%(3/4) checking for file conflicts                  [################------]  75%(4/4) checking for file conflicts                  [######################] 100%
   (0/4) checking available disk space                [----------------------]   0%(1/4) checking available disk space                [#####-----------------]  25%(2/4) checking available disk space                [###########-----------]  50%(3/4) checking available disk space                [################------]  75%(4/4) checking available disk space                [######################] 100%
   :: Processing package changes...
   (1/4) reinstalling qemu                            [----------------------]   0%(1/4) reinstalling qemu                            [----------------------]   0%(1/4) reinstalling qemu                            [----------------------]   0%(1/4) reinstalling qemu                            [----------------------]   0%(1/4) reinstalling qemu                            [----------------------]   0%(1/4) reinstalling qemu                            [----------------------]   0%(1/4) reinstalling qemu                            [----------------------]   0%(1/4) reinstalling qemu                            [----------------------]   0%(1/4) reinstalling qemu                            [----------------------]   0%(1/4) reinstalling qemu                            [#############---------]  60%(1/4) reinstalling qemu                            [######################] 100%
   (2/4) reinstalling libvirt                         [----------------------]   0%(2/4) reinstalling libvirt                         [----------------------]   0%(2/4) reinstalling libvirt                         [----------------------]   0%(2/4) reinstalling libvirt                         [----------------------]   0%(2/4) reinstalling libvirt                         [----------------------]   0%(2/4) reinstalling libvirt                         [----------------------]   0%(2/4) reinstalling libvirt                         [----------------------]   0%(2/4) reinstalling libvirt                         [----------------------]   0%(2/4) reinstalling libvirt                         [----------------------]   0%(2/4) reinstalling libvirt                         [----------------------]   0%(2/4) reinstalling libvirt                         [----------------------]   0%(2/4) reinstalling libvirt                         [----------------------]   0%(2/4) reinstalling libvirt                         [----------------------]   0%(2/4) reinstalling libvirt                         [----------------------]   0%(2/4) reinstalling libvirt                         [----------------------]   0%(2/4) reinstalling libvirt                         [----------------------]   0%(2/4) reinstalling libvirt                         [----------------------]   0%(2/4) reinstalling libvirt                         [----------------------]   0%(2/4) reinstalling libvirt                         [----------------------]   0%(2/4) reinstalling libvirt                         [----------------------]   0%(2/4) reinstalling libvirt                         [----------------------]   0%(2/4) reinstalling libvirt                         [----------------------]   0%(2/4) reinstalling libvirt                         [----------------------]   0%(2/4) reinstalling libvirt                         [----------------------]   0%(2/4) reinstalling libvirt                         [----------------------]   0%(2/4) reinstalling libvirt                         [----------------------]   0%(2/4) reinstalling libvirt                         [----------------------]   0%(2/4) reinstalling libvirt                         [----------------------]   0%(2/4) reinstalling libvirt                         [----------------------]   0%(2/4) reinstalling libvirt                         [----------------------]   0%(2/4) reinstalling libvirt                         [----------------------]   0%(2/4) reinstalling libvirt                         [----------------------]   0%(2/4) reinstalling libvirt                         [----------------------]   0%(2/4) reinstalling libvirt                         [----------------------]   0%(2/4) reinstalling libvirt                         [----------------------]   0%(2/4) reinstalling libvirt                         [----------------------]   0%(2/4) reinstalling libvirt                         [----------------------]   0%(2/4) reinstalling libvirt                         [----------------------]   0%(2/4) reinstalling libvirt                         [----------------------]   0%(2/4) reinstalling libvirt                         [----------------------]   0%(2/4) reinstalling libvirt                         [----------------------]   0%(2/4) reinstalling libvirt                         [----------------------]   0%(2/4) reinstalling libvirt                         [----------------------]   0%(2/4) reinstalling libvirt                         [----------------------]   0%(2/4) reinstalling libvirt                         [----------------------]   0%(2/4) reinstalling libvirt                         [----------------------]   0%(2/4) reinstalling libvirt                         [----------------------]   0%(2/4) reinstalling libvirt                         [----------------------]   0%(2/4) reinstalling libvirt                         [----------------------]   0%(2/4) reinstalling libvirt                         [----------------------]   0%(2/4) reinstalling libvirt                         [----------------------]   0%(2/4) reinstalling libvirt                         [----------------------]   0%(2/4) reinstalling libvirt                         [#######---------------]  36%(2/4) reinstalling libvirt                         [##############--------]  67%(2/4) reinstalling libvirt                         [####################--]  95%(2/4) reinstalling libvirt                         [######################] 100%
   >>> You may need to run 'rm -rf ~/.libvirt'
   (3/4) reinstalling virt-manager                    [----------------------]   0%(3/4) reinstalling virt-manager                    [######################] 100%
   (4/4) installing virt-viewer                       [----------------------]   0%(4/4) installing virt-viewer                       [######################] 100%
   :: Running post-transaction hooks...
   (1/8) Updating icon theme caches...
   (2/8) Reloading system manager configuration...
   (3/8) Applying kernel sysctl settings...
   (4/8) Creating system user accounts...
   (5/8) Reloading device manager configuration...
   (6/8) Arming ConditionNeedsUpdate...
   (7/8) Updating the desktop file MIME type cache...
   (8/8) Updating the MIME type database...
   Unknown media type in type 'all/all'
   Unknown media type in type 'all/allfiles'
#+END_SRC
   
安装好后，将当前用户加入 =libvirt= 组中
#+BEGIN_SRC shell :dir /sudo::
  sudo gpasswd -a $USER libvirt
#+END_SRC

