blog/2018/07/31/体验libvirt虚拟机/index.html
<!DOCTYPE html>
<html lang="en">
<head>
  <title>体验libvirt虚拟机 - 暗无天日</title>
  <meta charset="utf-8" />
  <meta http-equiv="X-UA-Compatible" content="IE=edge">
  <meta name="viewport"
        content="width=device-width, initial-scale=1, maximum-scale=1, user-scalable=no">
  <meta name="author" content="lujun9972" />
  <meta name="keywords" content="../" />
  <link rel="stylesheet" media="screen" href="/media/css/font.css" rel="stylesheet" type="text/css"/>
  <link rel="stylesheet" href="/media/css/main.css" type="text/css">
  <link rel="stylesheet" href="/media/css/kdComment.css" type="text/css">
  <link rel="stylesheet" href="https://cdn.jsdelivr.net/npm/gitalk@1/dist/gitalk.css">
</head>

  <body class="container">
<div>
  <header class="masthead">
    <h1 class="masthead-title"><a href="/">暗无天日</a></h1>
    <p>=============&gt;随便,谢谢</p>
    <nav class="site-nav">
      <div class="menu-icon">
        <svg viewBox="0 0 18 15">
          <path d="M18,1.484c0,0.82-0.665,1.484-1.484,1.484H1.484C0.665,2.969,0,2.304,0,1.484l0,0C0,0.665,0.665,0,1.484,0 h15.031C17.335,0,18,0.665,18,1.484L18,1.484z" fill="#ffff00"/>
          <path d="M18,7.516C18,8.335,17.335,9,16.516,9H1.484C0.665,9,0,8.335,0,7.516l0,0c0-0.82,0.665-1.484,1.484-1.484 h15.031C17.335,6.031,18,6.696,18,7.516L18,7.516z" fill="#ffff00"/>
          <path d="M18,13.516C18,14.335,17.335,15,16.516,15H1.484C0.665,15,0,14.335,0,13.516l0,0 c0-0.82,0.665-1.484,1.484-1.484h15.031C17.335,12.031,18,12.696,18,13.516L18,13.516z" fill="#ffff00"/>
        </svg>
      </div>
      <ul class="trigger">
              <li><a href="/years/">Years</a></li>
              <li><a href="/authors/">Authors</a></li>
              <li><a href="/tags/">Tags</a></li>
              <li><a href="/about/">About</a></li>
              <li><a href="https://github.com/lujun9972/lujun9972.github.com">Github</a></li>
              <li><a href="/rss.xml">RSS</a></li>
      </ul>
    </nav>
    <form method="get" id="searchform" action="http://www.google.com/search">
        <input type="text" class="field" name="q" id="s" placeholder="Search">
        <input type="hidden" name="as_sitesearch" value="lujun9972.github.io">
    </form>
  </header>
</div>

<div>
<div class="post">
<h1 class="title">体验libvirt虚拟机</h1>
<div id="table-of-contents">
<h2>&#30446;&#24405;</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgb0977b3">安装虚拟化工具</a></li>
<li><a href="#org9bda2cc">创建虚拟机</a></li>
<li><a href="#org68754e2">管理虚拟机</a>
<ul>
<li><a href="#org38f7c8e">显示所有的虚拟机列表</a></li>
<li><a href="#org6aa46ac">启动已经创建好的虚拟机</a></li>
<li><a href="#org727300e">获取虚拟机的信息</a></li>
<li><a href="#org59726ce">编辑虚拟机信息</a></li>
<li><a href="#org0c7bcca">设置主机启动后是否自动启动虚拟机</a></li>
<li><a href="#orgf109276">暂停虚拟机</a></li>
<li><a href="#orgd7a525f">回复暂停的虚拟机</a></li>
<li><a href="#org7de5109">关闭虚拟机</a></li>
<li><a href="#org9fe492e">克隆虚拟机</a></li>
<li><a href="#orgf9acac6">删除虚拟机</a></li>
</ul>
</li>
<li><a href="#org827f8bd">常用虚拟化管理应用工具</a></li>
</ul>
</div>
</div>

<div id="outline-container-orgb0977b3" class="outline-2">
<h2 id="orgb0977b3">安装虚拟化工具</h2>
<div class="outline-text-2" id="text-orgb0977b3">
<div class="org-src-container">
<pre class="src src-shell">sudo pacman -S qemu virt-manager virt-viewer libvirt --noconfirm
</pre>
</div>

<div class="org-src-container">
<pre class="src src-org">resolving dependencies...
looking for conflicting packages...

Packages (4) libvirt-4.5.0-1  qemu-2.12.0-2  virt-manager-1.5.1-1
             virt-viewer-6.0-1

Total Download Size:    0.22 MiB
Total Installed Size:  67.46 MiB
Net Upgrade Size:       1.90 MiB

:: Proceed with installation? [Y/n] 
:: Retrieving packages...
 virt-viewer-6.0-1-x...     0.0   B  0.00B/s 00:00 [----------------------]   0% virt-viewer-6.0-1-x...    40.4 KiB  67.4K/s 00:02 [###-------------------]  17% virt-viewer-6.0-1-x...   107.7 KiB   155K/s 00:00 [##########------------]  47% virt-viewer-6.0-1-x...   165.2 KiB   139K/s 00:00 [################------]  73% virt-viewer-6.0-1-x...   225.4 KiB   217K/s 00:01 [######################] 100%
(0/4) checking keys in keyring                     [----------------------]   0%(1/4) checking keys in keyring                     [#####-----------------]  25%(2/4) checking keys in keyring                     [###########-----------]  50%(3/4) checking keys in keyring                     [################------]  75%(4/4) checking keys in keyring                     [######################] 100%
(0/4) checking package integrity                   [----------------------]   0%(1/4) checking package integrity                   [##########------------]  46%(2/4) checking package integrity                   [#####################-]  98%(3/4) checking package integrity                   [#####################-]  98%(4/4) checking package integrity                   [######################] 100%
(0/4) loading package files                        [----------------------]   0%(1/4) loading package files                        [##########------------]  46%(2/4) loading package files                        [#####################-]  98%(3/4) loading package files                        [#####################-]  98%(4/4) loading package files                        [######################] 100%
(0/4) checking for file conflicts                  [----------------------]   0%(1/4) checking for file conflicts                  [#####-----------------]  25%(2/4) checking for file conflicts                  [###########-----------]  50%(3/4) checking for file conflicts                  [################------]  75%(4/4) checking for file conflicts                  [######################] 100%
(0/4) checking available disk space                [----------------------]   0%(1/4) checking available disk space                [#####-----------------]  25%(2/4) checking available disk space                [###########-----------]  50%(3/4) checking available disk space                [################------]  75%(4/4) checking available disk space                [######################] 100%
:: Processing package changes...
(1/4) reinstalling qemu                            [----------------------]   0%(1/4) reinstalling qemu                            [----------------------]   0%(1/4) reinstalling qemu                            [----------------------]   0%(1/4) reinstalling qemu                            [----------------------]   0%(1/4) reinstalling qemu                            [----------------------]   0%(1/4) reinstalling qemu                            [----------------------]   0%(1/4) reinstalling qemu                            [----------------------]   0%(1/4) reinstalling qemu                            [----------------------]   0%(1/4) reinstalling qemu                            [----------------------]   0%(1/4) reinstalling qemu                            [#############---------]  60%(1/4) reinstalling qemu                            [######################] 100%
(2/4) reinstalling libvirt                         [----------------------]   0%(2/4) reinstalling libvirt                         [----------------------]   0%(2/4) reinstalling libvirt                         [----------------------]   0%(2/4) reinstalling libvirt                         [----------------------]   0%(2/4) reinstalling libvirt                         [----------------------]   0%(2/4) reinstalling libvirt                         [----------------------]   0%(2/4) reinstalling libvirt                         [----------------------]   0%(2/4) reinstalling libvirt                         [----------------------]   0%(2/4) reinstalling libvirt                         [----------------------]   0%(2/4) reinstalling libvirt                         [----------------------]   0%(2/4) reinstalling libvirt                         [----------------------]   0%(2/4) reinstalling libvirt                         [----------------------]   0%(2/4) reinstalling libvirt                         [----------------------]   0%(2/4) reinstalling libvirt                         [----------------------]   0%(2/4) reinstalling libvirt                         [----------------------]   0%(2/4) reinstalling libvirt                         [----------------------]   0%(2/4) reinstalling libvirt                         [----------------------]   0%(2/4) reinstalling libvirt                         [----------------------]   0%(2/4) reinstalling libvirt                         [----------------------]   0%(2/4) reinstalling libvirt                         [----------------------]   0%(2/4) reinstalling libvirt                         [----------------------]   0%(2/4) reinstalling libvirt                         [----------------------]   0%(2/4) reinstalling libvirt                         [----------------------]   0%(2/4) reinstalling libvirt                         [----------------------]   0%(2/4) reinstalling libvirt                         [----------------------]   0%(2/4) reinstalling libvirt                         [----------------------]   0%(2/4) reinstalling libvirt                         [----------------------]   0%(2/4) reinstalling libvirt                         [----------------------]   0%(2/4) reinstalling libvirt                         [----------------------]   0%(2/4) reinstalling libvirt                         [----------------------]   0%(2/4) reinstalling libvirt                         [----------------------]   0%(2/4) reinstalling libvirt                         [----------------------]   0%(2/4) reinstalling libvirt                         [----------------------]   0%(2/4) reinstalling libvirt                         [----------------------]   0%(2/4) reinstalling libvirt                         [----------------------]   0%(2/4) reinstalling libvirt                         [----------------------]   0%(2/4) reinstalling libvirt                         [----------------------]   0%(2/4) reinstalling libvirt                         [----------------------]   0%(2/4) reinstalling libvirt                         [----------------------]   0%(2/4) reinstalling libvirt                         [----------------------]   0%(2/4) reinstalling libvirt                         [----------------------]   0%(2/4) reinstalling libvirt                         [----------------------]   0%(2/4) reinstalling libvirt                         [----------------------]   0%(2/4) reinstalling libvirt                         [----------------------]   0%(2/4) reinstalling libvirt                         [----------------------]   0%(2/4) reinstalling libvirt                         [----------------------]   0%(2/4) reinstalling libvirt                         [----------------------]   0%(2/4) reinstalling libvirt                         [----------------------]   0%(2/4) reinstalling libvirt                         [----------------------]   0%(2/4) reinstalling libvirt                         [----------------------]   0%(2/4) reinstalling libvirt                         [----------------------]   0%(2/4) reinstalling libvirt                         [----------------------]   0%(2/4) reinstalling libvirt                         [#######---------------]  36%(2/4) reinstalling libvirt                         [##############--------]  67%(2/4) reinstalling libvirt                         [####################--]  95%(2/4) reinstalling libvirt                         [######################] 100%
&gt;&gt;&gt; You may need to run 'rm -rf ~/.libvirt'
(3/4) reinstalling virt-manager                    [----------------------]   0%(3/4) reinstalling virt-manager                    [######################] 100%
(4/4) installing virt-viewer                       [----------------------]   0%(4/4) installing virt-viewer                       [######################] 100%
:: Running post-transaction hooks...
(1/8) Updating icon theme caches...
(2/8) Reloading system manager configuration...
(3/8) Applying kernel sysctl settings...
(4/8) Creating system user accounts...
(5/8) Reloading device manager configuration...
(6/8) Arming ConditionNeedsUpdate...
(7/8) Updating the desktop file MIME type cache...
(8/8) Updating the MIME type database...
Unknown media type in type 'all/all'
Unknown media type in type 'all/allfiles'
</pre>
</div>

<p>
安装好后，将当前用户加入 <code>libvirt</code> 组中
</p>
<div class="org-src-container">
<pre class="src src-shell">sudo gpasswd -a $<span style="color: #7590db;">USER</span> libvirt
</pre>
</div>
</div>
</div>
